Documents/УстановкаЦен.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>УстановкаЦен</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ЦеныПродажи</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПороговЦен</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидЦены</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена0</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена1</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Порог1</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена2</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Порог2</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена3</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Порог3</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РазрешитьПродажу</Name>
							<Comment>(не используется)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомСтроки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВидыЦен</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидЦены</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ЦеныПродажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ЦеныПродажи</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена0</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена1</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Порог1</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена2</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Порог2</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена3</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Порог3</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазрешитьПродажу</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ОчередьWebHook.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ОчередьWebHook</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Отправлен</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПопыток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоследняяПопытка</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ошибка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Создан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инициатор</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИД</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УчетнаяЗапись</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиИнтеграции</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипСобытия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСобытийWebHooks</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ИнвойсПродажи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыСобытийWebHooks.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ТипыСобытийWebHooks</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Цена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Остаток</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтатусЗаказа</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/УчетныеЗаписиИнтеграции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>УчетныеЗаписиИнтеграции</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТокенАвторизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаКонтрагентов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>WebhookURL</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>WebhookАктивен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>WebhookToken</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправлятьОстатки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправлятьЦены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Администратор</Name>
					<Comment> доступны данные всех учетных записей</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешитьПревышениеЦен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешитьСнижениеЦенНа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Склады</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/УстановкаЦен/Ext/ObjectModule.bsl
// © Primus1C  12.04.2024  НАЧАЛО ►

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
		
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если глЗапретЗаписиПоДате(Ссылка) Тогда Отказ = Истина; Возврат; КонецЕсли;
	
	омСервер.ЗаписатьОбщиеРеквизиты(ЭтотОбъект);

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ОбщегоНазначенияСервер.ЗаполнитьРеквизитыДокументаПоУмолчанию(ЭтотОбъект);

	Склад = ПараметрыСеанса.Склад;
	
	Выборка = Справочники.ВидыЦен.Выбрать(Новый Структура("ПометкаУдаления", Ложь));
	Пока Выборка.следующий() Цикл
		НовСтрокаТЧ = ВидыЦен.Добавить();
		НовСтрокаТЧ.ВидЦены = Выборка.Ссылка;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверкаЗаполнения(Отказ)
	
	Ошибки = Новый СписокЗначений;
	//ПроведениеДокументов.ПроверитьДубли(Товары, Ошибки, "Номенклатура");  // проверка на дубли производится в форме ПерезЗаписью()
	Для каждого Ош Из Ошибки Цикл
		Сообщить(Ош.Значение);
		Отказ = Истина;
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроверкаЗаполнения(Отказ);
	Если Отказ Тогда
		Возврат;	
	КонецЕсли;

	Запр = Новый Запрос; 
	Запр.УстановитьПараметр("Ссылка", Ссылка);  
	
	Запр.Текст = "ВЫБРАТЬ
	             |	УстановкаЦенТовары.Ссылка.Дата КАК Период,
	             |	УстановкаЦенТовары.Номенклатура КАК Номенклатура,
	             |	УстановкаЦенТовары.ВидЦены КАК ВидЦены,
	             |	УстановкаЦенТовары.Цена0 КАК Цена0,
	             |	УстановкаЦенТовары.Цена1 КАК Цена1,
	             |	УстановкаЦенТовары.Порог1 КАК Порог1,
	             |	УстановкаЦенТовары.Цена2 КАК Цена2,
	             |	УстановкаЦенТовары.Порог2 КАК Порог2,
	             |	УстановкаЦенТовары.Цена3 КАК Цена3,
	             |	УстановкаЦенТовары.Порог3 КАК Порог3,
	             |	УстановкаЦенТовары.РазрешитьПродажу КАК РазрешитьПродажу,
	             |	УстановкаЦенТовары.Ссылка.Склад КАК Склад
	             |ИЗ
	             |	Документ.УстановкаЦен.Товары КАК УстановкаЦенТовары
	             |ГДЕ
	             |	УстановкаЦенТовары.Ссылка = &Ссылка";
	Выборка = Запр.Выполнить().Выбрать(); 
	
	Движения.ЦеныПродажи.Записывать = Истина;
	
	Пока Выборка.Следующий() Цикл
		Движение = Движения.ЦеныПродажи.Добавить(); 
		ЗаполнитьЗначенияСвойств(Движение, Выборка);
		//Движение.Период = Дата;
	КонецЦикла;
	
	Движения.ЦеныПродажи.Записать();
	
	ЗарегистрироватьИзмененияЦенWebHook(ТаблицаИзмененийЦенИзДокумента(), Дата);
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ИзмененияЦен = ТаблицаИзмененийЦенПоРегистратору(Ссылка);
	Если ИзмененияЦен.Количество() = 0 Тогда
		ИзмененияЦен = ТаблицаИзмененийЦенИзДокумента();
	КонецЕсли;
	
	ЗарегистрироватьИзмененияЦенWebHook(ИзмененияЦен, Дата);
	
КонецПроцедуры

Функция ТаблицаИзмененийЦенИзДокумента()
	
	ИзмененияЦен = НоваяТаблицаИзмененийЦенWebHook();
	
	Для Каждого СтрокаТовары Из Товары Цикл
		ДобавитьИзменениеЦеныWebHook(ИзмененияЦен, СтрокаТовары.Номенклатура, Склад, СтрокаТовары.ВидЦены);
	КонецЦикла;
	
	Возврат ИзмененияЦен;
	
КонецФункции

Функция ТаблицаИзмененийЦенПоРегистратору(Регистратор)
	
	ИзмененияЦен = НоваяТаблицаИзмененийЦенWebHook();
	
	Если НЕ ЗначениеЗаполнено(Регистратор) Тогда
		Возврат ИзмененияЦен;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Регистратор", Регистратор);
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ЦеныПродажи.Номенклатура КАК Номенклатура,
	               |	ЦеныПродажи.Склад КАК Склад,
	               |	ЦеныПродажи.ВидЦены КАК ВидЦены
	               |ИЗ
	               |	РегистрСведений.ЦеныПродажи КАК ЦеныПродажи
	               |ГДЕ
	               |	ЦеныПродажи.Регистратор = &Регистратор";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ДобавитьИзменениеЦеныWebHook(ИзмененияЦен, Выборка.Номенклатура, Выборка.Склад, Выборка.ВидЦены);
	КонецЦикла;
	
	Возврат ИзмененияЦен;
	
КонецФункции

Функция НоваяТаблицаИзмененийЦенWebHook()
	
	ИзмененияЦен = Новый ТаблицаЗначений;
	ИзмененияЦен.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ИзмененияЦен.Колонки.Добавить("Склад", Новый ОписаниеТипов("СправочникСсылка.Склады"));
	ИзмененияЦен.Колонки.Добавить("ВидЦены", Новый ОписаниеТипов("СправочникСсылка.ВидыЦен"));
	
	Возврат ИзмененияЦен;
	
КонецФункции

Процедура ДобавитьИзменениеЦеныWebHook(ИзмененияЦен, Номенклатура, Склад, ВидЦены)
	
	Если НЕ ЗначениеЗаполнено(Номенклатура)
		Или НЕ ЗначениеЗаполнено(Склад)
		Или НЕ ЗначениеЗаполнено(ВидЦены) Тогда
		Возврат;
	КонецЕсли;
	
	НайдСтроки = ИзмененияЦен.НайтиСтроки(Новый Структура("Номенклатура,Склад,ВидЦены", Номенклатура, Склад, ВидЦены));
	Если НайдСтроки.Количество() > 0 Тогда
		Возврат;
	КонецЕсли;
	
	НоваяСтрока = ИзмененияЦен.Добавить();
	НоваяСтрока.Номенклатура = Номенклатура;
	НоваяСтрока.Склад = Склад;
	НоваяСтрока.ВидЦены = ВидЦены;
	
КонецПроцедуры

Процедура ЗарегистрироватьИзмененияЦенWebHook(ИзмененияЦен, ДатаДокумента)
	
	Если ИзмененияЦен.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИзмененияЦен", ИзмененияЦен);
	Запрос.УстановитьПараметр("ДатаДокумента", ДатаДокумента);
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ИзмененияЦен.Номенклатура КАК Номенклатура,
	               |	ИзмененияЦен.Склад КАК Склад,
	               |	ИзмененияЦен.ВидЦены КАК ВидЦены
	               |ПОМЕСТИТЬ ИзмененияЦен
	               |ИЗ
	               |	&ИзмененияЦен КАК ИзмененияЦен
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	УчетныеЗаписи.Ссылка КАК УчетнаяЗапись,
	               |	ИзмененияЦен.Номенклатура КАК Номенклатура,
	               |	ИзмененияЦен.Склад КАК Склад,
	               |	ИзмененияЦен.ВидЦены КАК ВидЦены
	               |ИЗ
	               |	ИзмененияЦен КАК ИзмененияЦен
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.УчетныеЗаписиИнтеграции.Склады КАК СкладыУчетныхЗаписей
	               |		ПО ИзмененияЦен.Склад = СкладыУчетныхЗаписей.Склад
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Склады КАК СправочникСклады
	               |		ПО ИзмененияЦен.Склад = СправочникСклады.Ссылка
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.УчетныеЗаписиИнтеграции КАК УчетныеЗаписи
	               |		ПО СкладыУчетныхЗаписей.Ссылка = УчетныеЗаписи.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныПродажи КАК БолееПоздниеЦены
	               |		ПО ИзмененияЦен.Номенклатура = БолееПоздниеЦены.Номенклатура
	               |			И ИзмененияЦен.Склад = БолееПоздниеЦены.Склад
	               |			И ИзмененияЦен.ВидЦены = БолееПоздниеЦены.ВидЦены
	               |			И БолееПоздниеЦены.Период > &ДатаДокумента
	               |ГДЕ
	               |	УчетныеЗаписи.Активен
	               |	И УчетныеЗаписи.WebhookАктивен
	               |	И УчетныеЗаписи.ОтправлятьЦены
	               //|	И УчетныеЗаписи.WebhookURL <> """"
	               |	И НЕ СправочникСклады.ПометкаУдаления
	               |	И БолееПоздниеЦены.Номенклатура ЕСТЬ NULL";
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	Выборка = РезультатыЗапроса[1].Выбрать();
	
	НаборНовыхЗаписей = РегистрыСведений.ОчередьWebHook.СоздатьНаборЗаписей();
	ЕстьНовыеЗаписи = Ложь;
	
	Пока Выборка.Следующий() Цикл
		ПерезаполнитьОчередьWebHookЦены(НаборНовыхЗаписей, Выборка.УчетнаяЗапись, Выборка.Номенклатура, Выборка.Склад, Выборка.ВидЦены);
		ЕстьНовыеЗаписи = Истина;
	КонецЦикла;
	
	Если ЕстьНовыеЗаписи Тогда
		НаборНовыхЗаписей.Записать(Ложь);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПерезаполнитьОчередьWebHookЦены(НаборНовыхЗаписей, УчетнаяЗапись, Номенклатура, Склад, ВидЦены)
	
	ТипСобытия = Перечисления.ТипыСобытийWebHooks.Цена;
	ПустаяДатаОтправки = Дата(1, 1, 1);
	
	УдалитьНеотправленныеЗаписиОчередиWebHookЦены(УчетнаяЗапись, Номенклатура, Склад, ВидЦены,
		ТипСобытия, ПустаяДатаОтправки);
	
	НоваяЗапись = НаборНовыхЗаписей.Добавить();
	НоваяЗапись.ИД = Новый УникальныйИдентификатор;
	НоваяЗапись.УчетнаяЗапись = УчетнаяЗапись;
	НоваяЗапись.ТипСобытия = ТипСобытия;
	НоваяЗапись.Номенклатура = Номенклатура;
	НоваяЗапись.Склад = Склад;
	НоваяЗапись.ВидЦены = ВидЦены;
	НоваяЗапись.Отправлен = ПустаяДатаОтправки;
	НоваяЗапись.Создан = ТекущаяДатаСеанса();
	НоваяЗапись.КоличествоПопыток = 0;
	НоваяЗапись.Ошибка = "";
	НоваяЗапись.Инициатор = Ссылка;
	
КонецПроцедуры

Процедура УдалитьНеотправленныеЗаписиОчередиWebHookЦены(УчетнаяЗапись, Номенклатура, Склад, ВидЦены,
	ТипСобытия, ПустаяДатаОтправки)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("УчетнаяЗапись", УчетнаяЗапись);
	Запрос.УстановитьПараметр("ТипСобытия", ТипСобытия);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("ВидЦены", ВидЦены);
	Запрос.УстановитьПараметр("Отправлен", ПустаяДатаОтправки);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОчередьWebHook.ИД КАК ИД,
	               |	ОчередьWebHook.УчетнаяЗапись КАК УчетнаяЗапись,
	               |	ОчередьWebHook.ТипСобытия КАК ТипСобытия,
	               |	ОчередьWebHook.Номенклатура КАК Номенклатура,
	               |	ОчередьWebHook.Склад КАК Склад,
	               |	ОчередьWebHook.ВидЦены КАК ВидЦены
	               |ИЗ
	               |	РегистрСведений.ОчередьWebHook КАК ОчередьWebHook
	               |ГДЕ
	               |	ОчередьWebHook.УчетнаяЗапись = &УчетнаяЗапись
	               |	И ОчередьWebHook.ТипСобытия = &ТипСобытия
	               |	И ОчередьWebHook.Номенклатура = &Номенклатура
	               |	И ОчередьWebHook.Склад = &Склад
	               |	И ОчередьWebHook.ВидЦены = &ВидЦены
	               |	И ОчередьWebHook.Отправлен = &Отправлен";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаписьОчереди = РегистрыСведений.ОчередьWebHook.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(ЗаписьОчереди, Выборка);
		ЗаписьОчереди.Удалить();
	КонецЦикла;
	
КонецПроцедуры

// © Primus1C  ОКОНЧАНИЕ ◄
